/****************************************************************************/
/*	 POJ读书笔记2.1 —— 鸡兔同笼	2750		皮皮 2014-7-2					*/
/****************************************************************************/
#include <stdio.h>

void cage(){
	int count;
	scanf("%d",&count);
	int a;
	while(count--){
		scanf("%d",&a);
		if(a%2){						//奇数无解
			printf("0 0\n");
		}else{
			printf("%d %d\n",a/4+a%4/2, a/2);	//最少a/4(剩下的a%4/2都是鸡); 最多a/2(没有兔)
		}			
	}
}

int __55main(){
	cage();
	return 0;
}
